class BasePageData:
    home_page_url = "https://qa-scooter.praktikum-services.ru/"
    order_page_url = "https://qa-scooter.praktikum-services.ru/order"
    track_page_url = "https://qa-scooter.praktikum-services.ru/track"
    dzen_url = "https://dzen.ru"

class HomePageData:
    answers_data = [
        'Сутки — 400 рублей. Оплата курьеру — наличными или картой.',
        'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.',
        'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.',
        'Только начиная с завтрашнего дня. Но скоро станем расторопнее.',
        'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.',
        'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.',
        'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.',
        'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
    ]

class OrderPageData:
    set_of_customer_data = [
        {"first_name": "Алена", "last_name": "Ибрагимова", "address": "Москва", "phone": "+7911111111",
         "comment": "Как можно быстрее"},
        {"first_name": "ав", "last_name": "ав", "address": "Лесная 35", "phone": "80000000000", "comment": ""}
    ]

